#--------------------------------图像参数配置----------------------------------#
# 默认旋转角度
DEFAULT_ROTATE = 0
# 默认是否反色
DEFAULT_INVERT = False
# 默认图片质量
DEFAULT_IMAGE_QUALITY = 100
#-----------------------------------时区配置--------------------------------------#
# 默认时区偏移（小时），如中国为8，印度为5.5，英国为0
DEFAULT_TIMEZONE_OFFSET = 8

#----------------------鉴权系统配置----------------------#
# 是否启用鉴权
AUTH_ENABLE = False
# 鉴权白名单（可访问的路径列表，支持字符串前缀匹配）
AUTH_WHITELIST = [
	'/public',
	'/favicon.ico',
	'/static',
	'/assets',
	'/pages',
	'/index.html',
]


